[LANG]
language=Filipino (Pilipinas)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=Mali sa SQL syntax
200002=Hindi umiiral ang file
200003=Sirang file
200004=Mali sa parameter
200026=Umiiral na ang pangalan ng table
200027=Hindi umiiral ang pangalan ng table
200028=Mali sa pag-import ng CSV file, nabigong bumuo ng SQL, pakitingnan ang nilalaman ng CSV file at configuration
300001=Walang napiling column ng table para gumawa ng index
300002=Hindi maaaring walang laman ang SQL statement
300003=Ang SQL analysis ay sumusuporta lamang sa SELECT query
[STRING]
home=Home
database=Database
analysis=Analysis
view=View
setting=Setting
items=mga record
tables=Mga Table
views=Mga View
triggers=Mga Trigger
columns=Mga Column
indexes=Mga Index
table=Table
clear-all=I-clear Lahat
yes=Oo
no=Hindi
welcome-text=Maligayang pagdating sa CuteSqlite
home-text1=Ang CuteSqlite ay isang graphical user client (GUI) tool para sa Sqlite3.
home-text2=Pinapayagan ka nitong mag-design, gumawa at mag-browse ng database, mag-manage ng database objects,
home-text3=at mag-insert ng data pati na rin mag-design at mag-run ng SQL queries para iproseso ang nakaimbak na data.
home-text4=Maaari mo ring i-migrate ang database at data mula sa ibang database vendor papunta sa Sqlite database.
db-section-text=Sqlite Database
analysis-text1=Binibigyang-daan ka ng CuteSqlite na i-analyze at i-optimize ang performance ng SQL statements.
analysis-text2=At pinapayagan ka ring i-analyze ang storage capacity ng bawat table sa database,
analysis-text3=pati na rin i-configure ang mga parameter ng database, para ma-optimize ang database.
perf-analysis-section-text=Performance Analysis
error-text=System Error:
create-database=Gumawa ng bagong database (Ctrl+N)
open-database=Magbukas ng database (Ctrl+O)
refresh-database=I-refresh ang database (F5)
delete-database=Tanggalin sa listahan ang napiling database (Del)
override-user-db=Ang data ng file na natanggal ay hindi na maibabalik, sigurado ka bang i-override ang database?
create-db-success-text=Matagumpay na nagawa ang database
open-db-exists-inlist=Nakabukas na ang database, huwag ulitin ang operasyon
open-db-success-text=Matagumpay na nabuksan ang database
delete-user-db=Sigurado ka bang tanggalin sa listahan ang database na "{dbName}"?
delete-db-success-text=Matagumpay na natanggal sa listahan ang database
query-editor=Query Editor
history=Kasaysayan
history-tip=Kasaysayan (F8)
result-list=Resulta
result-info=Impormasyon
result-table-data=Data ng Table
table-properties=Properties ng Table
exec-select-sql=I-execute ang napiling query (F9)
exec-all-sql=I-execute ang lahat ng query (F10)
explain-select-sql=I-explain ang napiling SQL statement (F11)
explain-query-plan-sql=I-explain ang query plan ng napiling SQL statement (F12)
query-page-help=Auto-complete function: [Tab]->susunod na tab; [Ctrl+Space]->ilista ang magkakatugmang tab; [Ctrl+Enter]->ilista ang lahat ng tab
no-select-userdb=Walang napiling database
no-sql-statement=Walang SQL statement sa query editor
no-sql-content=Walang laman na SQL statement sa query editor
show-form-view=Ipakita ang form view
export-result-as=I-export bilang... (Ctrl+Alt+E)
copy-result-data=Kopyahin ang data sa clipboard
clear-all=I-clear Lahat
ok=OK
cancel=Kanselahin
export-text-description=Piliin ang format para i-export ang data
csv-settings=CSV Options
csv-field-settings=Column
csv-line-settings=Row
csv-charset-settings=Character Set
excel-settings=Excel Options
sql-settings=SQL Options
export-fields-settings=Piliin ang column na ie-export
terminated-by=Delimiter
enclosed-by=Enclosure
escaped-by=Escape Character
field-terminated-by=Column Delimiter
field-enclosed-by=Column Enclosure
field-escaped-by=Column Escape Character
line-terminated-by=Line Delimiter
add-column-name=Magdagdag ng column name sa header
csv-charset=Character Set
excel-column-max-size=Limit sa Laki ng Text Column
excel-decinmal-places=Decimal Places
structure-only=Structure Lang
data-only=Data Lang
structure-and-data=Structure at Data
select-all=Piliin Lahat
deselect-all=Alisin ang Pagkakapili Lahat
save-to-file=I-save sa File
expert-fmt-error=Pakipili ang file format para i-export ang data
terminated-by-error=Paki-input ang value para sa "Delimiter"
enclosed-by-error=Paki-input ang value para sa "Enclosure"
escaped-by-error=Paki-input ang value para sa "Escape Character"
line-terminated-by-error=Mali ang value ng "Line Delimiter"
excel-column-max-size-error=Paki-input ang value para sa "Limit sa Laki ng Text Column"
excel-decinmal-places-error=Paki-input ang value para sa "Decimal Places"
export-sql-error=Pakipili ang SQL options
selected-fields-error=Pakipili ang column na ie-export
export-path-error=Paki-input ang path ng export file
sql-notsupport-multitable-query-error=Hindi supported ang pag-export ng resulta ng multi-table query at subquery
export-success-text=Matagumpay na na-export, {rows} row ng data ang na-export, buksan ang file?
open-the-file=Buksan ang File
export-file-exists-prompt=Umiiral na ang {export-path}, palitan?
limit-rows=Limitahan ang Row
offset=Simulang Row
rows=Bilang ng Row
copy-all-rows-to-clipboard=Kopyahin ang lahat ng row sa clipboard	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Kopyahin ang napiling row sa clipboard	Ctrl+Alt+H
copy-all-rows-as-sql=Kopyahin ang lahat ng row bilang SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Kopyahin ang napiling row bilang SQL	Ctrl+Alt+K
read-only=Read-Only
filter=Filter (Ctrl+Alt+F)
filter-in-use=Ginagamit ang Filter
refresh=I-refresh (Ctrl+F5)
refresh-page=I-refresh
new-row-tip=Bagong Row (Ctrl+Alt+N)
copy-row-tip=Kopyahin ang Row (Ctrl+Alt+C)
save-tip=I-save (Ctrl+Alt+S)
delete-tip=Tanggalin ang napiling row (Ctrl+Del)
cancel-tip=I-undo ang pagbabago (Ctrl+Alt+Z)
revert-tip=Ibalik
save=I-save
revert=I-undo ang pagbabago
column=Pangalan ng Column
condition=Condition
value=Value
delete-confirm-text=Sigurado ka bang tanggalin ang napiling row?
query=Query
result=Resulta
affected-rows=Naapektuhang Row
exec-time=Oras ng Pag-execute
transfer-time=Oras ng Pag-transfer
total-time=Kabuuang Oras
database-create=Gumawa ng Database		Ctrl+N
database-open=Magbukas ng Database		Ctrl+O
database-refresh=I-refresh ang Database		Ctrl+R
database-delete=Tanggalin ang Database		Del
database-copy=Kopyahin ang Database bilang...	Ctrl+P
database-export-as-sql=I-export ang Database sa SQL	Ctrl+E
database-import-from-sql=Mag-import ng SQL sa Database	Ctrl+I
database-new=Gumawa
database-new-table=Table
database-new-view=View
database-new-trigger=Trigger
export-as-sql-text-description=I-export ang napiling database table/view/trigger bilang SQL
select-database=Napiling Database
database-objects=Object
structure-and-data-settings=Structure at Data Settings
insert-statement-settings=INSERT Statement Settings
tbl-statement-settings=Table Statement Settings
retain-column-text=Panatilihin ang column name sa "Insert Into"
contain-multi-rows-text=Bawat "Insert" statement ay naglalaman ng maraming row (VALUES)
retain-table-text=Panatilihin ang lumang table (Create Table If Not Exists ...)
override-table-text=Palitan ang lumang table (DROP TABLE, pagkatapos CREATE TABLE)
import-from-sql-text-description=I-execute nang maramihan ang mga statement sa SQL file.
abort-on-error-text=Tumigil kapag may error.
import-file-not-exists=Ang SQL file na ini-import ay hindi umiiral, pakipili muli.
import-path-empty-error=Hindi maaaring walang laman ang path ng import file.
import=Mag-import
export=Mag-export
tbl-name=Pangalan ng Table
new-table=Gumawa ng Table
new-view=Gumawa ng View
new-trigger=Gumawa ng Trigger
database=Database
schema=Schema
table-columns=Column
table-indexes=Index
table-foreignkeys=Foreign Key
column-name=Pangalan ng Column
data-type=Uri ng Data
default=Default
check=Check
index-name=Pangalan ng Index
index-type=Uri ng Index
index-unique=Unique
partial-clause=Partial Clause
comments=Komento
to-be-selected=Column na pipiliin
selected=Napili na
up=▲
down=▼
no-columns-selected=Walang napiling column, pakipili
sql-preview=SQL Preview
tbl-name-empty=Hindi maaaring walang laman ang pangalan ng table
tbl-name-duplicated=Umiiral na ang pangalan ng table
create-table-success-text=Matagumpay na nagawa ang table.
alter-table-success-text=Matagumpay na nabago ang table.
rename-table-success-text=Matagumpay na nabago ang pangalan ng table.
delete-column-confirm-text=Ang napiling column ay tinutukoy ng isa o higit pang index. Ang pagtanggal sa column na ito ay magbabago rin sa kaukulang index. Sigurado ka bang magpatuloy sa pagtanggal?
delete-index-confirm-text=Ang napiling index ay tinutukoy ng isa o higit pang column. Ang pagtanggal sa index na ito ay magbabago rin sa kaukulang column. Sigurado ka bang magpatuloy sa pagtanggal?
delete-confirm-text=Sigurado ka bang magpatuloy sa pagtanggal?
new-view=Gumawa ng View
new-trigger=Gumawa ng Trigger
create-a-view-name=Pangalan ng Bagong View
view-name-not-empty=Hindi maaaring walang laman ang pangalan ng bagong view
view-name-duplicated=Umiiral na ang pangalan ng view
create-a-trigger-name=Pangalan ng Trigger
trigger-name-not-empty=Hindi maaaring walang laman ang pangalan ng trigger
trigger-name-duplicated=Umiiral na ang pangalan ng trigger
execute-sql-success=Matagumpay na na-execute ang SQL
copy-db-success-text=Matagumpay na nakopya ang database
table-open=Buksan ang Data ng Table		Alt+O
table-create=Gumawa ng Table		Alt+N
table-alter=Baguhin ang Table		Alt+A
table-rename=Palitan ang Pangalan ng Table		Alt+M
table-truncate=Walang lamanin ang Table		Alt+T
table-drop=Tanggalin ang Table		Alt+Del
table-copy-as=Kopyahin ang Table sa...		Alt+P
table-sharding-as=Paghati-hati ng Data		Alt+G
table-export=I-export ang Table sa...	Alt+E
table-import-sql=Mag-import mula sa SQL File	Alt+I
table-import-csv=Mag-import mula sa CSV File	Alt+J
table-manage-index=Manage Table Indexes
table-manage-foreign-key=Manage Table Foreign Keys
properties=Properties
primary-key-duplicated=Paulit-ulit ang Primary Key.
foreignkey-name=Pangalan ng Foreign Key
referencing-columns=Column sa Table na Ito
referenced-table=Reference Table
referenced-columns=Reference Column
on-update=Sa Update
on-delete=Sa Delete
insert-new-column=Magdagdag ng bagong column
insert-new-index=Magdagdag ng bagong index
insert-new-foreignkey=Magdagdag ng bagong foreign key
insert-del-column=Tanggalin ang napiling column
insert-del-index=Tanggalin ang napiling index
insert-del-foreignkey=Tanggalin ang napiling foreign key
select-referenced-table-first=Pakipili muna ang reference table
new-table-name=Pangalan ng Bagong Table
table-name-not-empty=Hindi maaaring walang laman ang pangalan ng bagong table
table-name-duplicated=Umiiral na ang pangalan ng bagong table
ai-column-exists=Umiiral na ang AUTOINCREMENT column.
ai-fobidden-multi-pk=May AUTOINCREMENT column na, hindi pinapayagan ang maraming primary key column.
ai-column-must-integer=Ang AUTOINCREMENT column ay dapat na INTEGER type.
truncate-table-confirm-text=Pagkatapos walang lamanin ang table, hindi na maibabalik ang data, sigurado ka bang walang lamanin?
truncate-table-success-text=Matagumpay na nawalan ng laman ang data table
drop-table-confirm-text=Pagkatapos tanggalin ang data table, hindi na maibabalik ang data, sigurado ka bang tanggalin?
drop-table-success-text=Matagumpay na natanggal ang data table
copy-table-text-description=I-configure ang copy parameters, sumusuporta sa paghati-hati ng data table
from-db-name=Source Database
from-tbl-name=Source Table
to-db-name=Target Database
to-tbl-name=Target Table
table-sharding-setttings=Paghati-hati ng Data Table
enable-table-sharding=I-activate ang paghati-hati ng data table
table-suffix-begin={suffix} Simulang Integer
table-suffix-end={suffix} Tapos na Integer
advanced-settings=Advanced na Options sa Table Sharding
enable-copy-data-with-strategy=I-activate ang strategy para kopyahin ang data sa shard table
sharding-strategy-express-text=Sharding Strategy Expression: {n}
preview-sql=I-preview ang SQL Statement
structure-and-data-settings-unknown=Hindi napili ang Structure at Data Settings
table-suffix-error=Hindi valid ang shard integer, pakilagay ang tamang value
target-table-name-no-n=Ang target table ay dapat maglaman ng string "{n}".
sharding-strategy-express-empty=Hindi maaaring walang laman ang sharding strategy expression
copy-table-success-text=Matagumpay na nakopya ang table.
start=Simula
complete=Tapos
express-title=Table Sharding Strategy Expression
functions=Function
express-editor-help=Expression - i-double click ang function o column, i-insert sa editor
import-from-csv-text-description=Configuration para mag-import ng data mula sa CSV file
source-csv-file=Source CSV File Path
target-database=Target Database
target-table=Target Table
columns-setttings=Column
csv-data=CSV Data
column-name-on-top=Unang row bilang column name
line-terminated-by=Line Delimiter
csv-null-as-keyword=null/NULL bilang SQL Keyword
encoding=Character Set
import-success-text=Matagumpay na na-import
incorrect-sql-statement=Maling SQL statement
import-error-text=Mali sa Pag-import
table-manage-columns=Manage Columns
table-drop-column=Tanggalin ang Column
table-manage-indexes=Manage Indexes
table-drop-index=Tanggalin ang Index
create-view=Gumawa ng Bagong View
open-view=Buksan ang View
drop-view=Tanggalin ang View
create-trigger=Gumawa ng Trigger
open-trigger=Buksan ang Trigger
drop-trigger=Tanggalin ang Trigger
drop-view-confirm-text=Pagkatapos tanggalin ang view, hindi na maibabalik ang view, sigurado ka bang tanggalin?
drop-view-success-text=Matagumpay na natanggal ang view
drop-trigger-confirm-text=Pagkatapos tanggalin ang trigger, hindi na maibabalik ang trigger, sigurado ka bang tanggalin?
drop-trigger-success-text=Matagumpay na natanggal ang trigger
sql-templates=SQL Statement Templates
pragma-templates=Pragmas
sql-log=SQL History Log
clear-all=I-clear Lahat
use=Gamitin
explain=I-explain
top=I-pin
untop=I-unpin
copy=Kopyahin
delete=Tanggalin
today=Ngayong Araw
yestoday=Kahapon
delete-sql-log-confirm-text=Sigurado ka bang gusto mong tanggalin ang SQL log?
copy-to-clipboard=Nakopya na sa clipboard
save-success-text=Matagumpay na nai-save
delete-success-text=Matagumpay na natanggal
data-has-changed=Nabago na ang data, sigurado ka bang isara ang page?
not-save-and-close=Huwag i-save, Isara
cancel=Kanselahin ang Pagsasara
table-export-as=I-export ang Data Table	Alt+E
export-as-sql-success-text=Matagumpay na na-export, buksan ang file?
new-query=Bagong Query Window (F7)
save-current=I-save ang Kasalukuyan (Ctrl+S)
save-all=I-save Lahat (Ctrl+Shift+S)
first-page=Unang Pahina
prev-page=Nakaraang Pahina
next-page=Sunod na Pahina
last-page=Huling Pahina
save-if-data-has-changed=Nabago na ang data, sigurado ka bang i-save muna?
unsort=I-undo ang Pagkaka-sort
tab-close-this=Isara Ito
tab-close-others=Isara ang Iba
tab-close-left=Isara Lahat sa Kaliwa
tab-close-right=Isara Lahat sa Kanan
perf-analysis=Performance Analysis
perf-analysis-reports=Analysis Report
store-analysis=Storage Analysis
db-params=Database Parameters
not-select-sql=Sumusuporta lamang sa SELECT statement
open-sql-log=Buksan ang SQL log para sa performance analysis (Ctrl+L)
add-sql-analysis=I-input ang SQL statement para sa performance analysis (Ctrl+I)
sql-log-not-found=Hindi mahanap ang SQL log, pakitingnan kung natanggal na
original-sql=Original na SQL Statement
where-clause-analysis=WHERE Clause Analysis
order-clause-analysis=ORDER Clause Analysis
covering-index-analysis=Covering Index Analysis
table-join-analysis=Joins Analysis
in-table=Data Table
where-use-column=Gumamit ng column ang WHERE statement
order-use-column=Gumamit ng column ang ORDER statement
covering-index-column=Gumamit ng column ang WHERE at ORDER statement
where-use-index=Gumamit ng index ang WHERE statement
order-use-index=Gumamit ng index ang ORDER statement
use-covering-index=Gumamit ng covering index
create-index-for-performance=Mungkahi: Gumawa ng index para sa mga sumusunod na column para mapabuti ang query performance
hint-index-for-performance=Pahiwatig: Ang index na {hintIndexName} ay sumasaklaw na sa mga column: {hintIndexColumns}
create-covering-index-for-performance=Mungkahi: Gumawa ng covering index para sa mga sumusunod na column para mapabuti ang query performance
create-index-togeger=Gumawa ng Index (Magkasama)
create-index-individ=Gumawa ng Index (Magkahiwalay)
create-covering-index=Gumawa ng Covering Index
explain-query-plan=I-explain ang Query Plan
query-optimizer-pseudocode=Ipinapakita ng pseudocode sa ibaba ang execution process ng query optimizer
cycle-count=Cycle Statistics
optimize-cycle-count=Pahiwatig: Ang pagpapalit ng iba't ibang pagkakasunod-sunod ng JOIN table ay maaaring mag-optimize at magbawas ng bilang ng cycles.
general-settings=General Settings
about=Tungkol Sa
language-setting=Interface Language Setting
change-language-restart-text=Ang pagpapalit ng wika ay nangangailangan na i-restart ang software na ito.
close-and-restart=Isara at I-restart
do-not-restart=Huwag I-restart
about-us=Tungkol Sa Amin
about-us-description=Ang CuteSqlite ay isang open-source software na binuo ng may-akda na si Xuehan Qin.
version-info=Version
version-info-description=CuteSqlite v0.2.2 beta (64-bit)
feedback=Feedback
feedback-description=Kung mayroon kang mga isyu sa software, o may mga ideya at mungkahi para sa application na ito, pakilagyan ang form sa ibaba para mag-feedback sa amin.
content-text=Nilalaman
license=Apache License Version 2.0
select-columns-analysis=SELECT Column Analysis
select-use-column=Gumamit ang SELECT statement ng mga sumusunod na column
select-use-column-count=Bilang ng Column
select-use-column-advice=Mungkahi: Ang SELECT statement ay pumili ng higit sa {maxColumns} column, bawasan ang column para mapabuti ang query performance.
select-use-column-tips=Pahiwatig: Bawasan ang column para mapabuti ang query performance.
sql-perf-report-prefix=sql-perf-report-
store-analysis-prefix=Storage Analysis:
analysis-sql=SQL Analysis
open-perf-report=Buksan ang Report		Alt+O
drop-perf-report=Tanggalin ang Report		Alt+Del
drop-perf-report-confirm-text=Sigurado ka bang tanggalin ang report?
store-analysis-text=Binibigyang-daan kang i-analyze ang storage capacity ng database, data table, table indexes
table-store-analysis=Table - {tblName}
index-store-analysis=Index - {idxName} - Table:{tblName}
db-disk-used-title=Disk Space Usage Report, DB Path:{dbPath}
page-size-text=Laki ng Page (unit: bytes)
page-size-tips=Laki ng Page (unit: bytes)
file-bytes-text=Laki ng File (unit: bytes)
file-bytes-tips=Laki ng File (unit: bytes)
file-pgcnt-text=Bilang ng page sa buong file (measured value)
file-pgcnt-tips=Bilang ng page sa buong file (measured value)
file-pgcnt2-text=Bilang ng page sa buong file (computed value)
file-pgcnt2-tips=Bilang ng page sa buong file (computed value)
inuse-pgcnt-text=Bilang ng page na nag-iimbak ng data (nagagamit na)
inuse-pgcnt-tips=Bilang ng page na nag-iimbak ng data (nagagamit na)
free-pgcnt2-text=Bilang ng page na walang data (bawat header)
free-pgcnt2-tips=Bilang ng page na walang data (bawat header)
free-pgcnt-text=Bilang ng page na walang data (computed value)
free-pgcnt-tips=Bilang ng page na walang data (computed value)
av-pgcnt-text=Bilang ng awtomatikong nalinis na page
av-pgcnt-tips=Bilang ng awtomatikong nalinis na page
ntable-text=Bilang ng table sa database
ntable-tips=Bilang ng table sa database
nindex-text=Bilang ng index
nindex-tips=Bilang ng index
nmanindex-text=Bilang ng defined index
nmanindex-tips=Bilang ng defined index
nautoindex-text=Bilang ng implicit index (auto-increment index)
nautoindex-tips=Bilang ng implicit index (auto-increment index)
user-payload-text=Bilang ng bytes na nakaimbak ng user payload
user-payload-tips=Bilang ng bytes na nakaimbak ng user payload
all-tbl-entrycnt-title=Kabuuang Data ng Lahat ng Table (bilang ng record)
all-tbl-idx-pagecnt-title=Kabuuang Page ng Lahat ng Table at Index Nito
sperate-tbl-idx-pagecnt-title=Page ng Lahat ng Table at Index na Kinukuwenta nang Magkahiwalay
all-tbl-idx-report-title=Lahat ng Table at Index
total-pages-percent-text=Porsyento ng Kabuuang Database
total-pages-percent-tips=Porsyento ng Kabuuang Database
nentry-text=Kabuuang Data (bilang ng record)
nentry-tips=Kabuuang Data (bilang ng record)
storage-text=Bytes na Storage na Ginamit
storage-tips=Bytes na Storage na Ginamit
compressed-size-text=Bytes na Ginamit Pagkatapos I-compress
compressed-size-tips=Bytes na Ginamit Pagkatapos I-compress
payload-text=Bytes na Payload
payload-tips=Bytes na Payload
total-meta-text=Bytes na Metadata
total-meta-tips=Bytes na Metadata
depth-text=Depth ng B-Tree
depth-tips=Depth ng B-Tree
avg-payload-text=Average na Payload Bawat Record
avg-payload-tips=Average na Payload Bawat Record
avg-unused-text=Average na Hindi Nagamit na Bytes Bawat Record
avg-unused-tips=Average na Hindi Nagamit na Bytes Bawat Record
avg-meta-text=Average na Metadata Bawat Record
avg-meta-tips=Average na Metadata Bawat Record
avg-fanout-text=Average na Fanout
avg-fanout-tips=Average na Fanout
gap-cnt-text=Hindi Magkakasunod na Page
gap-cnt-tips=Hindi Magkakasunod na Page
mx-payload-text=Maximum na Payload Bawat Record
mx-payload-tips=Maximum na Payload Bawat Record
ovfl-cnt-text=Bilang ng Nagamit na Overflow Data
ovfl-cnt-tips=Bilang ng Nagamit na Overflow Data
int-pages-text=Bilang ng Nagamit na Index Page
int-pages-tips=Bilang ng Nagamit na Index Page
leaf-pages-text=Bilang ng Nagamit na Leaf Page
leaf-pages-tips=Bilang ng Nagamit na Leaf Page
ovfl-pages-text=Bilang ng Nagamit na Overflow Page
ovfl-pages-tips=Bilang ng Nagamit na Overflow Page
total-pages-text=Kabuuang Nagamit na Page
total-pages-tips=Kabuuang Nagamit na Page
int-unused-text=Hindi Nagamit na Bytes sa Index Page
int-unused-tips=Hindi Nagamit na Bytes sa Index Page
leaf-unused-text=Hindi Nagamit na Bytes sa Leaf Page
leaf-unused-tips=Hindi Nagamit na Bytes sa Leaf Page
ovfl-unused-text=Hindi Nagamit na Bytes sa Overflow Page
ovfl-unused-tips=Hindi Nagamit na Bytes sa Overflow Page
total-unused-text=Hindi Nagamit na Bytes sa Lahat ng Page
total-unused-tips=Hindi Nagamit na Bytes sa Lahat ng Page
all-table-report-title=Lahat ng Table (hindi kasama ang index)
all-indices-report-title=Lahat ng Index (hindi kasama ang table)
tbl-and-all-idx-report-title=Table {tblName} at Lahat ng Index Nito
tbl-only-report-title=Table {tblName} (hindi kasama ang anumang index)
idx-only-report-title=Lahat ng Index ng Table {tblName}
tbl-report-title=Table {tblName}
idx-report-title=Index {idxName} ng Table {tblName}
props-tbl-only-report-title=Storage Analysis ng Table {tblName}
props-idx-props-only-report-title=Lahat ng Index ng Table {tblName}
db-pragma-params=PRAGMA Parameters
db-quick-config-params=Mabilis na Configuration Options
select-pragma=PRAGMA
pragma-analysis-limit-tips=Mag-query o magbago ng limitasyon sa mga setting ng analysis (ANALYZE). Ito ay tinatayang bilang ng row na sinusuri ng ANALYZE command sa bawat index.
pragma-application-id-tips=Ginagamit para i-query o itakda ang 32-bit signed big-endian na "Application ID" integer na matatagpuan sa offset 68 sa database header.
pragma-auto-vacuum-tips=Mag-query o magtakda ng auto-vacuum status sa database.
pragma-automatic-index-tips=Mag-query, magtakda, o huwag paganahin ang automatic index function.
pragma-busy-timeout-tips=Mag-query o magbago ng setting ng busy timeout.
pragma-cache-size-tips=Mag-query o magbago ng maximum na bilang ng database disk page na iminumungkahi ng SQLite na itago sa memory para sa bawat bukas na database file.
pragma-cache-spill-tips=Paganahin o huwag paganahin ang kakayahan ng paging program na mag-spill ng maruruming cache page sa database file sa gitna ng transaksyon.
pragma-case-sensitive-like-tips=Ang default na behavior ng LIKE operator ay huwag pansinin ang uppercase/lowercase para sa ASCII characters. Kaya bilang default, ang 'a' LIKE 'A' ay true.
pragma-cell-size-check-tips=Paganahin o huwag paganahin ang karagdagang sanity check kapag binabasa ang database B-tree page mula sa disk. Kapag pinagana ang cell size check, mas maagang matutukoy ang pagkasira ng database at mas maliit ang posibilidad na "kumalat".
pragma-checkpoint-fullfsync-tips=Mag-query o magbago ng fullfsync flag para sa checkpoint operations. Kung nakatakda ang flag na ito, ang F_FULLFSYNC synchronization method ay gagamitin sa panahon ng checkpoint operations sa mga system na sumusuporta sa F_FULLFSYNC. Ang default na value ng CHECKPOINT_FULLFSYNC flag ay OFF. Mac OS-X lang ang sumusuporta sa F_FULLFSYNC.
pragma-collation-list-tips=Nagbabalik ng listahan ng mga collation sequence na tinukoy para sa kasalukuyang database connection.
pragma-compile-options-tips=Nagbabalik ng mga pangalan ng compile-time options na ginamit noong binuo ang SQLite, isang opsyon sa bawat linya.
pragma-count-changes-tips=Mag-query o magbago ng count changes flag. Karaniwan, kapag hindi nakatakda ang count-changes flag, ang INSERT, UPDATE at DELETE statements ay hindi nagbabalik ng data.
pragma-data-store-directory-tips=Mag-query o magbago ng value ng global variable na sqlite3_data_directory, na ginagamit ng Windows operating system interface backend para tukuyin ang lokasyon ng pag-imbak ng mga database file na tinukoy na may relative path.
pragma-data-version-tips=Ipinapahiwatig na ang database file ay nabago. Ang mga interactive na program na nag-iimbak ng nilalaman ng database sa memory o nagpapakita ng nilalaman ng database sa screen ay maaaring gumamit ng PRAGMA data_version command para matukoy kung kailangan nilang i-refresh at i-reload ang memory o i-update ang screen display.
pragma-default-cache-size-tips=Mag-query o magtakda ng maximum na bilang ng disk cache page na iminumungkahi na ilaan para sa bawat bukas na database file.
pragma-defer-foreign-keys-tips=Iniuutos na ang lahat ng foreign key constraints ay ipagpaliban hanggang ang pinakalabas na transaksyon ay i-commit.
pragma-empty-result-callbacks-tips=Mag-query o magbago ng empty result callback flag.
pragma-encoding-tips=Text encoding na ginagamit ng pangunahing database, maaaring 'UTF-8', 'UTF-16le' (UTF-16 little-endian encoding) o 'UTF-16be' (UTF-16 big-endian encoding).
pragma-foreign-key-check-tips=Sinusuri ang database o table kung may paglabag sa foreign key constraints.
pragma-foreign-keys-tips=Mag-query, magtakda, o huwag paganahin ang pagpapatupad ng foreign key constraints.
pragma-freelist-count-tips=Nagbabalik ng bilang ng hindi nagamit na page sa database file.
pragma-full-column-names-tips=Mag-query o magbago ng full_column_names flag.
pragma-fullfsync-tips=Mag-query o magbago ng fullfsync flag. Tinutukoy ng flag na ito kung gagamitin ang F_FULLFSYNC synchronization method sa mga system na sumusuporta dito. Ang default na value ng fullfsync ay OFF. Mac OS X lang ang sumusuporta sa F_FULLFSYNC.
pragma-hard-heap-limit-tips=Magtakda ng limitasyon sa dami ng heap memory para sa lahat ng database connection sa isang process.
pragma-ignore-check-constraints-tips=Paganahin o huwag paganahin ang pagpapatupad ng CHECK constraints. Ang default na setting ay OFF, ibig sabihin ang CHECK constraints ay pinapatupad bilang default.
pragma-incremental-vacuum-tips=Nagiging sanhi ng hanggang N page na matanggal mula sa freelist.
pragma-integrity-check-tips=Magsagawa ng low-level formatting at consistency check sa database.
pragma-journal-mode-tips=Mag-query o magtakda ng journal mode para sa database na nauugnay sa kasalukuyang database connection.
pragma-journal-size-limit-ttips=Maglimita sa laki ng rollback journal at WAL files na iniimbak sa file system pagkatapos ng transaksyon o checkpoint.
pragma-legacy-alter-table-tips=Itakda o i-query ang value ng legacy_alter_table flag.
pragma-locking-mode-tips=Itakda o i-query ang locking mode ng database connection. Ang locking mode ay NORMAL o EXCLUSIVE.
pragma-max-page-count-tips=Mag-query o magtakda ng maximum na bilang ng page sa database file.
pragma-mmap-size-tips=Mag-query o magbago ng maximum na bilang ng bytes na nakalaan para sa memory-mapped I/O sa isang database.
pragma-module-list-tips=Nagbabalik ng listahan ng virtual table modules na naka-register sa database connection.
pragma-optimize-tips=Subukang i-optimize ang database.
pragma-page-count-tips=Nagbabalik ng kabuuang bilang ng page sa database file.
pragma-page-size-tips=Mag-query o magtakda ng laki ng page ng database. Ang laki ng page ay dapat na power of two sa pagitan ng 512 at 65536.
pragma-parser-trace-tips=Buksan ang trace ng SQL parser na ginagamit ng SQLite sa loob. Magkakabisa kapag na-compile gamit ang SQLITE_DEBUG.
pragma-query-only-tips=Hadlangan ang pagbabago ng data sa database file. Kapag pinagana, anumang pagtatangka sa CREATE, UPDATE, DROP, INSERT o UPDATE ay magdudulot ng SQLITE_READONLY error.
pragma-quick-check-tips=Magsagawa ng low-level formatting at consistency check sa database, laktawan ang UNIQUE at index consistency check.
pragma-read-uncommitted-tips=Mag-query, magtakda, o huwag paganahin ang READ UNCOMMITTED isolation.
pragma-recursive-triggers-tips=Mag-query, magtakda, o huwag paganahin ang recursive function ng trigger.
pragma-reverse-unordered-selects-tips=Kapag pinagana, ang PRAGMA na ito ay nagiging sanhi ng maraming SELECT statements na walang ORDER BY clause na maglabas ng mga resulta sa karaniwang baligtad na pagkakasunod-sunod.
pragma-schema-version-tips=Kunin o itakda ang schema_version integer sa offset 40 sa database header.
pragma-secure-delete-tips=Mag-query o magbago ng secure-delete setting.
pragma-short-column-names-tips=Mag-query o magbago ng short column names flag.
pragma-soft-heap-limit-tips=Maglimita sa dami ng heap memory na ginagamit ng lahat ng database connection sa isang process.
pragma-stats-tips=Nagbabalik ng karagdagang impormasyon tungkol sa mga table at index.
pragma-synchronous-tips=Mag-query o magbago ng setting ng "synchronous" flag.
pragma-temp-store-tips=Mag-query o magbago ng value ng global variable na sqlite3_temp_directory, na ginagamit ng maraming operating system interface backend para tukuyin ang lokasyon ng pag-imbak ng mga temporary table at index.
pragma-threads-tips=Bilang ng helper threads na sinisimulan ng prepared statement para tumulong sa query.
pragma-trusted-schema-ttips=Pinapayagan ba ang mga SQL function at virtual table na hindi na-audit sa seguridad na tumakbo sa schema. Tinutukoy kung ang mga view, trigger, o schema expression (tulad ng CHECK constraints, DEFAULT clauses, generated columns, expression indexes at/o partial indexes) ay pinapayagang tumakbo ng mga SQL function at virtual table na hindi na-audit sa seguridad.
pragma-user-version-tips=Kunin o itakda ang user_version integer sa offset 60 sa database header.
pragma-vdbe-addoptrace-tips=Ang kumpletong VDBE opcodes ay ipinapakita habang ginagawa ang code generation. Sa kondisyon na ang SQLite ay na-compile gamit ang SQLITE_DEBUG option at naka-enable ang vdbe_debug.
pragma-vdbe-debug-tips=Buksan ang VDBE debugging. Sa kondisyon na ang SQLite ay na-compile gamit ang SQLITE_DEBUG option.
pragma-vdbe-listing-tips=Ipakita ang kumpletong listahan ng virtual machine opcodes sa standard output. Sa kondisyon na ang SQLite ay na-compile gamit ang SQLITE_DEBUG option at naka-enable ang vdbe_debug.
pragma-vdbe-trace-tips=I-print ang virtual machine opcodes sa standard output habang kinukwenta. Sa kondisyon na ang SQLite ay na-compile gamit ang SQLITE_DEBUG option at naka-enable ang vdbe_debug.
pragma-wal-autocheckpoint-tips=Mag-query o magtakda ng auto-checkpoint interval para sa write-ahead log.
pragma-wal-checkpoint-tips=Nagiging sanhi ng nilalaman sa write-ahead log para sa database X sa database connection D na mailipat sa database file, at i-reset ang write-ahead log.
pragma-writable-schema-tips=Pinapayagan ang sqlite_schema table na baguhin gamit ang ordinaryong UPDATE, INSERT at DELETE statements. Babala: Ang pag-abuso sa pragma na ito ay madaling magdulot ng pagkasira ng database file.
pragma-save-confirm=Ang PRAGMA statement ay makakaapekto sa pagpapatakbo ng database, sigurado ka bang i-execute ang statement sa ibaba?
confirm-exec-text=Kumpirmahin at I-execute